tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Emacs dependency management
brew "cask"
# Dynamic, general-purpose programming language
brew "clojure"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Build tool for Clojure
brew "leiningen"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Edit and manage bibliographies
cask "bibdesk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager
cask "lastpass"
# VPN client focusing on security
cask "protonvpn"
# Configurable document editor that supports Markdown
cask "typora"
mas "HP Smart", id: 1474276998
